In [60]:
pip install openpyxl #install openpyxl for opening .xlsx data set

Requirement already satisfied: openpyxl in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

In [61]:
import pandas as pd 
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from datetime import datetime

In [62]:
dt = pd.concat(pd.read_excel("online_retail_II.xlsx", sheet_name=None).values())
dt.columns

Index(['Invoice', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'Price', 'Customer ID', 'Country'],
      dtype='object')

## Exploratory data analysis
#### This data set contains of 1067371 entries and 8 columns:
* Invoice: Invoice number. Nominal. A 6-digit integer uniquely assigned to each transaction. If this code begins with the letter 'c' then it indicates cancellation.
* StockCode: Product code (item). Nominal. A 5-digit integer uniquely assigned to each individual product.
* Description: Product name (item). Nominal.
* Quantity: Quantity of each product (item) per transaction. Number.
* InvoiceDate: Invoice date and time. Number. Date and time when the transaction was created.
* Price: Unit price. Number. Product price per unit is in British pounds (Â£).
* Customer ID: Customer code. Nominal. A 5-digit integer uniquely assigned to each customer.
* Country: Country name. Nominal. Name of the country where the customer resides.

In [63]:
dt.shape

(1067371, 8)

#### Display the first 10 rows of data

In [64]:
dt.head(10)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom
5,489434,22064,PINK DOUGHNUT TRINKET POT,24,2009-12-01 07:45:00,1.65,13085.0,United Kingdom
6,489434,21871,SAVE THE PLANET MUG,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom
7,489434,21523,FANCY FONT HOME SWEET HOME DOORMAT,10,2009-12-01 07:45:00,5.95,13085.0,United Kingdom
8,489435,22350,CAT BOWL,12,2009-12-01 07:46:00,2.55,13085.0,United Kingdom
9,489435,22349,"DOG BOWL , CHASING BALL DESIGN",12,2009-12-01 07:46:00,3.75,13085.0,United Kingdom

#### Display 10 random rows of the data to check for cleanliness of the data set

In [65]:
dt.sample(10)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
320473,520654,22087,PAPER BUNTING WHITE LACE,12,2010-08-27 12:32:00,2.95,15358.0,United Kingdom
376343,525753,85094,CANDY SPOT EGG WARMER RABBIT,1,2010-10-07 10:19:00,2.51,NaN,United Kingdom
294531,518067,21629,SQUARE FLOOR CUSHION VINTAGE RED,2,2010-08-04 12:54:00,7.95,15817.0,United Kingdom
496331,535814,82580,BATHROOM METAL SIGN,1,2010-11-28 15:24:00,0.55,16987.0,United Kingdom
8164,537129,22242,5 HOOK HANGER MAGIC TOADSTOOL,12,2010-12-05 12:15:00,1.65,13506.0,United Kingdom
423727,573153,22138,BAKING SET 9 PIECE RETROSPOT,72,2011-10-28 07:39:00,4.25,12678.0,France
252242,513714,79067,CORONA MEXICAN TRAY,1,2010-06-28 11:57:00,3.75,17841.0,United Kingdom
179488,552278,22332,SKULLS PARTY BAG + STICKER SET,4,2011-05-08 12:36:00,1.65,15059.0,United Kingdom
474176,576840,22076,6 RIBBONS EMPIRE,1,2011-11-16 15:23:00,1.25,NaN,United Kingdom
25352,538368,85014B,RED RETROSPOT UMBRELLA,1,2010-12-12 10:57:00,5.95,15503.0,United Kingdom

#### What we can observe from this is that there are missing values in **CustomerID** column. Upon further inspection with the *.info()* function, we can see that there are also missing values in the **Description** column

In [66]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1067371 entries, 0 to 541909
Data columns (total 8 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   Invoice      1067371 non-null  object
 1   StockCode    1067371 non-null  object
 2   Description  1062989 non-null  object
 3   Quantity     1067371 non-null  int64
 4   InvoiceDate  1067371 non-null  datetime64[ns]
 5   Price        1067371 non-null  float64
 6   Customer ID  824364 non-null   float64
 7   Country      1067371 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 73.3+ MB

#### In fact, almost 20% of the rows are missing with **CustomerID** values which is a huge number and can greatly affect the result of this analysis. Another problem is that the data type of **CustomerID** should be int with 5 digits rather that float type. Aside from that, the data seems to be cleaned.

#### We then use the *.describe()* funtion to show the summary statistics such as *mean, median, quarticles,...* for the numerical columns, specifically the **Quantity** and the **Price** columns. These 2 columns have the minimum values to be negative which is impossible siince you cannot than 0 items or/and for negative price.

In [67]:
dt[["Quantity", "Price"]].describe()

           Quantity         Price
count  1.067371e+06  1.067371e+06
mean   9.938898e+00  4.649388e+00
std    1.727058e+02  1.235531e+02
min   -8.099500e+04 -5.359436e+04
25%    1.000000e+00  1.250000e+00
50%    3.000000e+00  2.100000e+00
75%    1.000000e+01  4.150000e+00
max    8.099500e+04  3.897000e+04

#### We then move to the non-numerical columns with unique values which is the **Country** column. The functions return 43 indicates that there are 43 countries in this column and most of them are from Europe.

In [68]:
dt["Country"].nunique()

43

In [69]:
dt["Country"].unique()

array(['United Kingdom', 'France', 'USA', 'Belgium', 'Australia', 'EIRE',
       'Germany', 'Portugal', 'Japan', 'Denmark', 'Nigeria',
       'Netherlands', 'Poland', 'Spain', 'Channel Islands', 'Italy',
       'Cyprus', 'Greece', 'Norway', 'Austria', 'Sweden',
       'United Arab Emirates', 'Finland', 'Switzerland', 'Unspecified',
       'Malta', 'Bahrain', 'RSA', 'Bermuda', 'Hong Kong', 'Singapore',
       'Thailand', 'Israel', 'Lithuania', 'West Indies', 'Lebanon',
       'Korea', 'Brazil', 'Canada', 'Iceland', 'Saudi Arabia',
       'Czech Republic', 'European Community'], dtype=object)

#### Almost 92% of the transaction are coming from United Kingdom.

In [70]:
dt["Country"].value_counts(normalize=True).head(10) * 100

Country
United Kingdom    91.938979
EIRE               1.673832
Germany            1.651160
France             1.342551
Netherlands        0.481557
Spain              0.357045
Switzerland        0.298771
Belgium            0.292588
Portugal           0.245463
Australia          0.179225
Name: proportion, dtype: float64

#### There are some missing values in column **Description** and **CustomerID**.

#### We will start dealing with the missing values in **Description** column.

In [71]:
dt["Description"].isnull().mean() * 100

np.float64(0.4105414143723223)

#### 0.41% of the **Description** column have missing values.

In [72]:
dt[dt["Description"].isnull()].sample(10)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
280656,561479,21594,NaN,-1,2011-07-27 13:32:00,0.0,NaN,United Kingdom
218874,556074,22519,NaN,-19,2011-06-08 15:14:00,0.0,NaN,United Kingdom
138573,502658,85206B,NaN,-50,2010-03-25 17:01:00,0.0,NaN,United Kingdom
53268,494252,21893,NaN,-24,2010-01-12 16:43:00,0.0,NaN,United Kingdom
83550,497168,84775,NaN,-9,2010-02-05 17:23:00,0.0,NaN,United Kingdom
434375,530877,84751B,NaN,-60,2010-11-04 15:04:00,0.0,NaN,United Kingdom
75237,542561,84424A,NaN,-1,2011-01-28 14:52:00,0.0,NaN,United Kingdom
156350,550133,85099F,NaN,-1092,2011-04-14 13:49:00,0.0,NaN,United Kingdom
173326,551689,22625,NaN,-9,2011-05-03 13:35:00,0.0,NaN,United Kingdom
43780,493192,72655C,NaN,8,2009-12-22 13:18:00,0.0,NaN,United Kingdom

#### Upon inspecting the first 10 rows of the rows that contain NaN values in **Description** column, it seams like the rows containing missing values in **Description** column also have negative values for **Quantity**, alot of 0.0 for **Price** and missing values for **CustomerID**

#### We will further inspect this bit of data by diving deeper into the above thesis.

In [73]:
np.all(dt[dt["Description"].isnull()]["Customer ID"].isnull())

np.True_

#### All of the NaN value **Description** rows also have NaN value for their corresponding **CustomerID**.

In [74]:
(dt[dt["Description"].isnull()]["Quantity"] <= 0).mean() * 100

np.float64(61.364673664993155)

#### Around 61% of the NaN value **Description** rows have the **Quantity** of equal or less than 0.

In [75]:
all(dt[dt["Description"].isnull()]["Country"] == "United Kingdom")

True

#### All of the NaN value **Description** rows are correspoding to the **Country** United Kingdom.

In [76]:
all(dt[dt["Description"].isnull()]["Price"] == 0.0)

True

#### All of the NaN value **Description** rows have the price of 0.0

## Data Cleaning

#### Now we will proceed to deal with missing values in **CustomerID** column.

In [77]:
dt["Customer ID"].isnull().mean() * 100

np.float64(22.766872999172733)

#### Around 23% of **CustomerID** rows are absence with values.

In [78]:
dt[dt["Customer ID"].isnull()].sample(10)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
524805,580610,23173,REGENCY TEAPOT ROSES,2,2011-12-05 11:48:00,19.96,NaN,United Kingdom
366289,568721,21809,CHRISTMAS HANGING TREE WITH BELL,5,2011-09-28 16:24:00,0.83,NaN,United Kingdom
152454,503871,84578,ELEPHANT TOY WITH BLUE T-SHIRT,1,2010-04-08 11:36:00,4.21,NaN,United Kingdom
367482,524999,22423,REGENCY CAKESTAND 3 TIER,1,2010-10-01 17:34:00,25.49,NaN,United Kingdom
210247,555277,22946,WOODEN ADVENT CALENDAR CREAM,1,2011-06-01 17:30:00,16.63,NaN,United Kingdom
287908,562114,84913A,SOFT PINK ROSE TOWEL,1,2011-08-02 16:14:00,3.29,NaN,United Kingdom
108030,499765,22090,PAPER BUNTING RETRO SPOTS,1,2010-03-02 13:15:00,5.91,NaN,United Kingdom
226669,556812,20718,RED RETROSPOT SHOPPER BAG,2,2011-06-14 17:25:00,2.46,NaN,United Kingdom
201422,554285,20718,RED RETROSPOT SHOPPER BAG,1,2011-05-23 14:15:00,3.29,NaN,United Kingdom
60196,494784,21790,VINTAGE SNAP CARDS,1,2010-01-18 13:20:00,1.66,NaN,United Kingdom

In [79]:
dt[dt["Customer ID"].isnull()]["Description"].nunique()

4872

In [80]:
(dt[dt["Customer ID"].isnull()]["Quantity"] <= 0).mean() * 100

np.float64(1.7308143386816017)

In [81]:
(dt[dt["Customer ID"].isnull()]["Price"] <= 0.0).mean() * 100

np.float64(2.5250301431646003)

#### There are no obvious pattern for why there are missing values in **CustomerID** column

#### Next we will analyze the negative values of **Quantity** and **Price** columns

In [82]:
(dt["Price"] <= 0).mean() * 100

np.float64(0.5815222635803297)

In [83]:
(dt["Quantity"] <= 0).mean() * 100

np.float64(2.1501427338760375)

In [101]:
(dt[["Quantity", "Price"]] <= 0).any(axis=1).mean() * 100

np.float64(0.0)

#### There are no rows that contain negative values on both Quantity and Price column.

#### Around 0.6% of **Price** values are missing and 2.1% of **Quatity**  values are missing

In [84]:
dt[dt["Quantity"] <= 0].sample(10)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
234420,C557519,21844,RED RETROSPOT MUG,-1,2011-06-20 17:15:00,2.95,16739.0,United Kingdom
201253,C508741,21733,RED HANGING HEART T-LIGHT HOLDER,-2,2010-05-18 11:30:00,2.55,14680.0,United Kingdom
86945,C543621,22767,TRIPLE PHOTO FRAME CORNICE,-1,2011-02-10 14:59:00,9.95,14475.0,United Kingdom
393563,C570831,23064,CINDERELLA CHANDELIER,-2,2011-10-12 13:25:00,49.95,14911.0,EIRE
198092,C554010,POST,POSTAGE,-1,2011-05-20 12:44:00,75.00,17940.0,United Kingdom
363054,C568532,23172,REGENCY TEA PLATE PINK,-1,2011-09-27 13:54:00,1.65,14356.0,United Kingdom
119148,C546529,22764,"RUSTIC WOODEN CABINET, GLASS DOORS",-1,2011-03-14 13:05:00,24.95,15502.0,United Kingdom
367623,C568899,23292,SPACEBOY CHILDRENS CUP,-1,2011-09-29 13:20:00,1.25,12619.0,Germany
509532,C579347,23225,CHERUB HEART DECORATION SILVER,-36,2011-11-29 11:47:00,0.83,17658.0,United Kingdom
316578,C520205,22465,HANGING METAL STAR LANTERN,-96,2010-08-24 16:11:00,1.45,17133.0,United Kingdom

In [85]:
dt[dt["Quantity"] <= 0]["Invoice"].astype("str").str.startswith("C").mean() * 100

np.float64(84.93681917211329)

In [86]:
(dt[dt["Invoice"].astype("str").str.startswith("C")]["Quantity"] <= 0.).mean() * 100

np.float64(99.99487021647685)

#### By taking a look at the **Invoice** column, there is a C at the beginning in most of the values. Which can be understanded that these orders were cancelled.

#### Next, we will create an additional column called **TotalPrice** calculated by **Quantity** multiplied by **Price**. Rows with the **TotalPrice** equal or less than 0 will be dropped.

In [87]:
dt["TotalPrice"] = dt["Quantity"] * dt["Price"]

In [88]:
(dt["TotalPrice"] <= 0).mean() * 100

np.float64(2.4077851093949527)

#### Around 2.4% of the data consist of rows that have the total price equal or less than 0.

In [89]:
dt[dt["TotalPrice"] <= 0]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
178,C489449,22087,PAPER BUNTING WHITE LACE,-12,2009-12-01 10:33:00,2.95,16321.0,Australia,-35.40
179,C489449,85206A,CREAM FELT EASTER EGG BASKET,-6,2009-12-01 10:33:00,1.65,16321.0,Australia,-9.90
180,C489449,21895,POTTING SHED SOW 'N' GROW SET,-4,2009-12-01 10:33:00,4.25,16321.0,Australia,-17.00
181,C489449,21896,POTTING SHED TWINE,-6,2009-12-01 10:33:00,2.10,16321.0,Australia,-12.60
182,C489449,22083,PAPER CHAIN KIT RETRO SPOT,-12,2009-12-01 10:33:00,2.95,16321.0,Australia,-35.40
...,...,...,...,...,...,...,...,...,...
540449,C581490,23144,ZINC T-LIGHT HOLDER STARS SMALL,-11,2011-12-09 09:57:00,0.83,14397.0,United Kingdom,-9.13
541541,C581499,M,Manual,-1,2011-12-09 10:28:00,224.69,15498.0,United Kingdom,-224.69
541715,C581568,21258,VICTORIAN SEWING BOX LARGE,-5,2011-12-09 11:57:00,10.95,15311.0,United Kingdom,-54.75
541716,C581569,84978,HANGING HEART JAR T-LIGHT HOLDER,-1,2011-12-09 11:58:00,1.25,17315.0,United Kingdom,-1.25
541717,C581569,20979,36 PENCILS TUBE RED RETROSPOT,-5,2011-12-09 11:58:00,1.25,17315.0,United Kingdom,-6.25

#### There are approximately 25700 rows that will be dropped to clean the data.

#### Next, we will proceed to remove all the rows with TotalPrice < 0 and rows containing missing values in **Description**. We will also remove cancelled orders except for 1 at row 76799 because it is described as "Manual".

In [90]:
all(~dt[dt["TotalPrice"] > 0]["Description"].isnull())

True

In [91]:
dt[(dt["Invoice"].astype("str").str.startswith("C")) & (dt["TotalPrice"] > 0)]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
76799,C496350,M,Manual,1,2010-02-01 08:24:00,373.57,NaN,United Kingdom,373.57

#### At this point, the data is cleaned and ready for further analysis.

#### Let's now create a function that loads the data, and filter out rows with negative TotalPrice and cancelled orders. There is an argument in the function of keep rows with missing values in the Customer ID column.

In [94]:
def load_dt(sheet_name="Year 2009-2010", keepna=True):
    
    dt = pd.read_excel("online_retail_II.xlsx", 
                       sheet_name=sheet_name, 
                       parse_dates=["InvoiceDate"],
                       dtype={"Invoice": "str", "StockCode": "str"})
    
    if isinstance(dt, dict):
        dt = pd.concat(dt.values())
    
    dt["TotalPrice"] = dt["Quantity"] * dt["Price"]
    dt = dt.query("TotalPrice > 0")
    dt = dt[~dt["Invoice"].str.startswith("C")]
    dt = dt[~dt["StockCode"].str.contains("TEST")]
    
    if not keepna:
        dt.dropna(inplace = True)
        
    dt.drop_duplicates(inplace=True)
        
    assert all(dt["InvoiceDate"] > datetime(2009,1,1))
    assert all(dt["InvoiceDate"] < datetime(2012,1,1))
    
    return dt

In [95]:
dt = load_dt(None)

In [96]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1007903 entries, 0 to 541909
Data columns (total 9 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   Invoice      1007903 non-null  object
 1   StockCode    1007903 non-null  object
 2   Description  1007903 non-null  object
 3   Quantity     1007903 non-null  int64
 4   InvoiceDate  1007903 non-null  datetime64[ns]
 5   Price        1007903 non-null  float64
 6   Customer ID  779415 non-null   float64
 7   Country      1007903 non-null  object
 8   TotalPrice   1007903 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(4)
memory usage: 76.9+ MB